jl1987/FreeRTOS_CANOpen/FreeRTOS-CANOpen-STM32F103/USER/inc/FreeRTOSConfig.h
/*
    FreeRTOS V8.0.1 - Copyright (C) 2014 Real Time Engineers Ltd. 
    All rights reserved

    VISIT http://www.FreeRTOS.org TO ENSURE YOU ARE USING THE LATEST VERSION.

    ***************************************************************************
     *                                                                       *
     *    FreeRTOS provides completely free yet professionally developed,    *
     *    robust, strictly quality controlled, supported, and cross          *
     *    platform software that has become a de facto standard.             *
     *                                                                       *
     *    Help yourself get started quickly and support the FreeRTOS         *
     *    project by purchasing a FreeRTOS tutorial book, reference          *
     *    manual, or both from: http://www.FreeRTOS.org/Documentation        *
     *                                                                       *
     *    Thank you!                                                         *
     *                                                                       *
    ***************************************************************************

    This file is part of the FreeRTOS distribution.

    FreeRTOS is free software; you can redistribute it and/or modify it under
    the terms of the GNU General Public License (version 2) as published by the
    Free Software Foundation >>!AND MODIFIED BY!<< the FreeRTOS exception.

    >>!   NOTE: The modification to the GPL is included to allow you to     !<<
    >>!   distribute a combined work that includes FreeRTOS without being   !<<
    >>!   obliged to provide the source code for proprietary components     !<<
    >>!   outside of the FreeRTOS kernel.                                   !<<

    FreeRTOS is distributed in the hope that it will be useful, but WITHOUT ANY
    WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS
    FOR A PARTICULAR PURPOSE.  Full license text is available from the following
    link: http://www.freertos.org/a00114.html

    1 tab == 4 spaces!

    ***************************************************************************
     *                                                                       *
     *    Having a problem?  Start by reading the FAQ "My application does   *
     *    not run, what could be wrong?"                                     *
     *                                                                       *
     *    http://www.FreeRTOS.org/FAQHelp.html                               *
     *                                                                       *
    ***************************************************************************

    http://www.FreeRTOS.org - Documentation, books, training, latest versions,
    license and Real Time Engineers Ltd. contact details.

    http://www.FreeRTOS.org/plus - A selection of FreeRTOS ecosystem products,
    including FreeRTOS+Trace - an indispensable productivity tool, a DOS
    compatible FAT file system, and our tiny thread aware UDP/IP stack.

    http://www.OpenRTOS.com - Real Time Engineers ltd license FreeRTOS to High
    Integrity Systems to sell under the OpenRTOS brand.  Low cost OpenRTOS
    licenses offer ticketed support, indemnification and middleware.

    http://www.SafeRTOS.com - High Integrity Systems also provide a safety
    engineered and independently SIL3 certified version for use in safety and
    mission critical applications that require provable dependability.

    1 tab == 4 spaces!
*/


/**
 ******************************************************************************
 * @file    FreeRTOSConfig.h
 * @author  Jim
 * @version V1.0
 * @date    07-Sep-2014
 * @brief   This file provides FreeRTOS Configurations. Almost all the defination
 *          has been updated.(Being Dog-tired for 1 hour, you can compliment me now)
 *  
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT 2014 CSST Robot Research Center</center></h2>
 *
 *
 ******************************************************************************
 */


#ifndef FREERTOS_CONFIG_H
#define FREERTOS_CONFIG_H

/*-----------------------------------------------------------
 * Application specific definitions.
 *
 * These definitions should be adjusted for your particular hardware and
 * application requirements.
 *
 * THESE PARAMETERS ARE DESCRIBED WITHIN THE 'CONFIGURATION' SECTION OF THE
 * FreeRTOS API DOCUMENTATION AVAILABLE ON THE FreeRTOS.org WEB SITE.
 *
 * See http://www.freertos.org/a00110.html.
 *----------------------------------------------------------*/

#include "stm32f10x.h"  // Jim -> The "SystemCoreClock comes for here.

/* Ensure stdint is only used by the compiler, and not the assembler. */
#ifdef __ICCARM__
	#include <stdint.h>
	extern uint32_t SystemCoreClock;
#endif
/* 抢先多任务内核：1-优先级高的任务优先执行。0-任务无没有优先级，以时间片轮流执行 */
#define configUSE_PREEMPTION			1

/* IDLE任务的HOOK函数，OS功能扩展，需自定义函数：void vApplicationIdleHook(void) */
#define configUSE_IDLE_HOOK				0

/* SYSTEM TICK的HOOK函数，OS功能扩展，需自定义函数：void vApplicationTickHook(void) */
#define configUSE_TICK_HOOK				1

/* 系统CPU频率，单位是Hz，此处为168MHz */
#define configCPU_CLOCK_HZ				( SystemCoreClock )

/* 系统SYSTEM TICK每秒钟的发生次数，数值越大系统反应越快，但是CPU用在任务切换的开销就越多  */
#define configTICK_RATE_HZ				( ( TickType_t ) 1000 )

/* 系统任务优先级数。5 说明任务有5级优先度。这个数目越大耗费RAM越多 */
#define configMAX_PRIORITIES			( 5 )

/* 系统最小堆栈尺寸，注意128不是128字节，而是128个入栈。比如ARM32位，128个入栈就是512字节 */
#define configMINIMAL_STACK_SIZE		( ( unsigned short ) 128 )

/* 系统可用内存。一般设成除操作系统和程序所用RAM外的最大RAM。如20KRAM个人用2K，系统用3K，剩15即最大HEAP 。可以先设小然后看编译结果往大里加*/
#define configTOTAL_HEAP_SIZE			( ( size_t ) ( 15 * 1024 ) )

/* 任务的PC名字最大长度，因函数名编译完后就不见，故追踪时不知道哪个名字。10表示10个char */
#define configMAX_TASK_NAME_LEN			( 10 )

/* 是否设定成追踪，由PC端TraceCon.exe记录，也可以转到系统显示屏上 */
#define configUSE_TRACE_FACILITY		1

/* 就是SYSTEM TICK的长度，16是16位，如果是16位以下CPU，一般选1；如果是32位系统，一般选0 */ 
#define configUSE_16_BIT_TICKS			0 /* Means We Use 32 bit ticks*/

/* 简单理解就是和IDLE TASK同样优先级的任务执行情况。建议设成1，对系统影响不大 */
#define configIDLE_SHOULD_YIELD			1

/* MUTEXES是任务间通讯的一种方式，特别用于任务共享资源，如打印机，任务A用的时候就排斥别的任务应用，用完了别的任务才可以应用 */
#define configUSE_MUTEXES				1

/* 用于DEBUG，登记SEMAPHORESQ和QUEUE的最大个数，需要在任务用应用函数vQueueAddToRegistry()和vQueueUnregisterQueue()  */
#define configQUEUE_REGISTRY_SIZE		8

/* 用于DEBUG，判断是否有栈溢出，需自定义检查函数：void vApplicationStackOverflowHook(xTaskHandle *pxTask, signed portCHAR *pcTaskName) */
#define configCHECK_FOR_STACK_OVERFLOW	0

/*  确定是否用递归式的MUTEXES */
#define configUSE_RECURSIVE_MUTEXES		1

#define configUSE_MALLOC_FAILED_HOOK	0  //Jim-> original is 1

#define configUSE_APPLICATION_TASK_TAG	0

/* 是否用计数式的SEMAPHORES，SEMAPHORES也是任务间通讯的一种方式 */
#define configUSE_COUNTING_SEMAPHORES	1

#define configGENERATE_RUN_TIME_STATS	0


/* Co-routine definitions. */
/* 是否使用协程。协程公用堆栈，节省RAM，但是没有任务优先级高，也无法和任务通讯 */
#define configUSE_CO_ROUTINES 		0
/* 所有协程的最大优先级数，协程优先级永远低于任务。即先执行任务，ALL任务执行完才执行协程 */
#define configMAX_CO_ROUTINE_PRIORITIES ( 2 )

/* Software timer definitions. */
#define configUSE_TIMERS				1
#define configTIMER_TASK_PRIORITY		( 2 )
#define configTIMER_QUEUE_LENGTH		10
#define configTIMER_TASK_STACK_DEPTH	( configMINIMAL_STACK_SIZE * 2 )

/* Set the following definitions to 1 to include the API function, or zero
to exclude the API function. */
/* 设定可以改变任务优先度 */
#define INCLUDE_vTaskPrioritySet		1
/* 设定可以查询任务优先度 */ 
#define INCLUDE_uxTaskPriorityGet		1
/* 设定可以删除任务 */
#define INCLUDE_vTaskDelete				1
/* ?据说是可以回收删除任务后的资源(RAM等)? */
#define INCLUDE_vTaskCleanUpResources	1
/* 设置可以把任务挂起 */
#define INCLUDE_vTaskSuspend			1
/* 设置可以从中断恢复，比如系统睡眠，由中断唤醒 */
#define INCLUDE_vTaskDelayUntil			1
/* 设置任务延时，比如延迟30分钟，相对的时间，现在什么时间，不需要知道 */
#define INCLUDE_vTaskDelay				1

/* Cortex-M specific definitions. */
#ifdef __NVIC_PRIO_BITS
	/* __BVIC_PRIO_BITS will be specified when CMSIS is being used. */
	#define configPRIO_BITS       		__NVIC_PRIO_BITS  // 默认是4
#else
	#define configPRIO_BITS       		4        /* 15 priority levels */
#endif

/* The lowest interrupt priority that can be used in a call to a "set priority"
function. */  
/* 0xf=15，如果用NVIC_PriorityGroup_4，就分为了16个阶级(1个阶层就是1个preemption优先级)
0个阶层；高阶级可以打断低阶级，最多可以完成1个中断和15级嵌套 */
#define configLIBRARY_LOWEST_INTERRUPT_PRIORITY			0xf

/* The highest interrupt priority that can be used by any interrupt service
routine that makes calls to interrupt safe FreeRTOS API functions.  DO NOT CALL
INTERRUPT SAFE FREERTOS API FUNCTIONS FROM ANY INTERRUPT THAT HAS A HIGHER
PRIORITY THAN THIS! (higher priorities are lower numeric values. */
//#define configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY	5  //Original
#define configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY    5

/* Interrupt priorities used by the kernel port layer itself.  These are generic
to all Cortex-M ports, and do not rely on any particular library functions. */
/*  系统内核的中断优先级，中断优先级越低，越不会影响其他中断。一般设成最低 */
//#define configKERNEL_INTERRUPT_PRIORITY 		( configLIBRARY_LOWEST_INTERRUPT_PRIORITY << (8 - configPRIO_BITS) )  //Original
#define configKERNEL_INTERRUPT_PRIORITY         255  // Jim-255应该是最低了吧，原来的似乎很高啊

/* !!!! configMAX_SYSCALL_INTERRUPT_PRIORITY must not be set to zero !!!!
See http://www.FreeRTOS.org/RTOS-Cortex-M3-M4.html. */
/* 系统SVC中断优先级，这两项都在在M3和PIC32上应用 一定不能为0？*/
//#define configMAX_SYSCALL_INTERRUPT_PRIORITY 	( configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY << (8 - configPRIO_BITS) )  //Original
#define configMAX_SYSCALL_INTERRUPT_PRIORITY    5 //jim-原来的似乎为0？
	
/* Normal assert() semantics without relying on the provision of an assert.h
header file. */
#define configASSERT( x ) if( ( x ) == 0 ) { taskDISABLE_INTERRUPTS(); for( ;; ); }	
	
/* Definitions that map the FreeRTOS port interrupt handlers to their CMSIS
standard names. */
#define vPortSVCHandler     SVC_Handler
#define xPortPendSVHandler  PendSV_Handler
#define xPortSysTickHandler SysTick_Handler

#endif /* FREERTOS_CONFIG_H */

